Tekla.Structures.TeklaStructuresInternal.MateriaClient.ConnectionChangedEventArgs
Connection changed event args

Tekla.Structures.TeklaStructuresInternal.MateriaClient.ConnectionChangedEventArgs.Connected
Connected flag

Tekla.Structures.TeklaStructuresInternal.MateriaClient.ConnectionChangedEventArgs.Disconnected
Disconnected flag

Tekla.Structures.TeklaStructuresInternal.MateriaClient.ConnectionChangedEventArgs.Busy
Busy flag